# Importing Libraries

In [1]:
# Import Libraries
import pandas as pd
import numpy as np
import os

# Importing Dataframes

In [2]:
# Setting Variables
path = r'/Users/saikathalder/CareerFoundry/Data Immersion/Achievement 4/Instacart Basket Analysis 01182024'
path_mac = r'/Users/saikathalder/CareerFoundry/Data Immersion/Achievement 4/Instacart Basket Analysis 01182024'
# Importing Merged Dataframe
df_ords_prods_merge = pd.read_pickle(os.path.join(path_mac, '02 Data', 'Prepared Data', 'orders_products_merged_all_dataframes_new_variables_agg_variable.pkl'))
# Importing Customer Data Set
df_customers = pd.read_csv(os.path.join(path_mac, '02 Data', 'Original Data', 'customers.csv'))

## Verifying Dataframes

In [3]:
# Verifying df_ords_prods_merge
df_ords_prods_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,...,reordered,price_label,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_product_price,spending_flag,median_reorder,order_frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,0,Mid range products,Regulary busy,Most orders,32,Regular customer,20.0,High spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,1,Mid range products,Regulary busy,Most orders,32,Regular customer,20.0,High spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,0,Mid range products,Busiest days,Average orders,5,New customer,18.5,High spender,6.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,0,Mid range products,Slowest days,Most orders,3,New customer,14.0,High spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,1,Mid range products,Slowest days,Most orders,3,New customer,14.0,High spender,9.0,Frequent customer

In [4]:
# Getting the number of rows for df_ords_prods_merge
df_ords_prods_merge.shape[0]

32404859

In [5]:
# Verifying df_customers
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# df_customers Descriptive Analysis

In [6]:
# Column Names
df_customers.columns

Index(['user_id', 'First Name', 'Surnam', 'Gender', 'STATE', 'Age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

In [7]:
# Number of columns and rows
df_customers.shape

(206209, 10)

In [8]:
# Min, Mean and Max
df_customers.describe()
# Nothing seems out of the ordinary for the MIN, MEAN and MAX values of all the columns

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [9]:
# Data Types
df_customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [10]:
# Date of Join Min and Max 
x = df_customers['date_joined'].max()
y = df_customers['date_joined'].min()

print('The minimum value for date of join is ', y , ' and the maximum value for date of join is ', x)

The minimum value for date of join is  1/1/2017  and the maximum value for date of join is  9/9/2019

## Renaming Columns

In [11]:
# Renaming 'First Name' to 'first_name'
df_customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)
# Renaming 'Surnam' to 'last_name'
df_customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)
# Renaming 'Gender' to 'gender'
df_customers.rename(columns = {'Gender' : 'gender'}, inplace = True)
# Renaming 'STATE' to 'state'
df_customers.rename(columns = {'STATE' : 'state'}, inplace = True)
# Renaming 'Age' to 'age'
df_customers.rename(columns = {'Age' : 'age'}, inplace = True)
# Renaming 'n_dependants' to 'number_of_dependents'
df_customers.rename(columns = {'n_dependants' : 'number_of_dependents'}, inplace = True)
# Renaming 'fam_status' to 'marital_status'
df_customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [12]:
# Verifying Column Rename
df_customers.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'number_of_dependents', 'marital_status', 'income'],
      dtype='object')

# df_customers Consistency Checks

## Finding mixed type data

In [13]:
found_mix_type = False

for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)
    found_mix_type = True
    
if not found_mix_type:
    print('There are no mix type columns')

first_name

In [14]:
# Checking the data type for 'first_name'
df_customers['first_name'].dtype
# first_name only has objects as data type. This confirms that there is no mixed data type in product_name. 
#The reason because found_mix_type is coming True might be because of the NUll values

dtype('O')

## Finding Missing Values

In [15]:
# Checking for missing values
print(df_customers.isnull().sum())
# it seems first_name has 11259 missing values

user_id                     0
first_name              11259
last_name                   0
gender                      0
state                       0
age                         0
date_joined                 0
number_of_dependents        0
marital_status              0
income                      0
dtype: int64

In [16]:
# Creating a subset for null values from the 'first_name' column
df_nan = df_customers[df_customers['first_name'].isnull()==True]
df_nan

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependents,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [18]:
# Replacing NaN values with 'unknown'
df_customers.fillna('unknown', inplace = True)

In [19]:
#Verifying whether any NaN values exist now
df_customers.isnull().sum()

user_id                 0
first_name              0
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependents    0
marital_status          0
income                  0
dtype: int64

## Finding Duplicate Values

In [21]:
# Finding Duplicates for df_customers--original dataframe
df_dups = df_customers[df_customers.duplicated()]
df_dups
# it seems there are no duplicate values

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependents, marital_status, income]
Index: []

In [6]:
# Finding number of rows after consistency check
df_customers.shape[0]

206209

# Merging Dataframes

In [23]:
df_ords_prods_merge['user_id'].dtype

dtype('int64')

In [24]:
# Merging df_customers and df_ords_prods_merge
# Merge on user_id, how = 'inner'
df_ords_prods_customers_merge = df_customers.merge(df_ords_prods_merge, on = ['user_id'], how = 'inner', indicator = True)

In [25]:
# Checking the column names
df_ords_prods_customers_merge.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'number_of_dependents', 'marital_status', 'income',
       'product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'order_id', 'order_number', 'order_day_of_week', 'order_hour_of_day',
       'days_since_prior_order', 'add_to_cart_order', 'reordered',
       'price_label', 'busiest_days', 'busiest_period_of_day', 'max_order',
       'loyalty_flag', 'average_product_price', 'spending_flag',
       'median_reorder', 'order_frequency_flag', '_merge'],
      dtype='object')

In [26]:
# Checking the frequency count for _merge
df_ords_prods_customers_merge['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [27]:
# Checking the shape
df_ords_prods_customers_merge.shape

(32404859, 32)

# Exporting

In [29]:
df_ords_prods_customers_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers_merged_final.pkl'))